export const publicOfferText = `ПУБЛІЧНИЙ ДОГОВІР (ОФЕРТА)
на замовлення, купівлю-продаж і доставку товарів

Цей договір є офіційною та публічною пропозицією Продавця укласти договір купівлі-продажу Товару, представленого на сайті hlorka.ua. Даний договір є публічним, тобто відповідно до статті 633 Цивільного кодексу України, його умови є однаковими для всіх покупців незалежно від їх статусу (фізична особа, юридична особа, фізична особа-підприємець) без надання переваги одному покупцю перед іншим. Шляхом укладення цього Договору покупець в повному обсязі приймає умови та порядок оформлення замовлення, оплати товару, доставки товару, повернення товару, відповідальності за недобросовісне замовлення та усі інші умови договору. Договір вважається укладеним з моменту натискання кнопки «Підтвердити Замовлення» на сторінці оформлення замовлення в Розділі «Кошик» і отримання Покупцем від Продавця підтвердження замовлення в електронному вигляді.

1. Визначення термінів

1.1. Публічна оферта (далі - «Оферта») - публічна пропозиція Продавця, адресована невизначеному колу осіб, укласти з Продавцем договір купівлі-продажу товару дистанційним способом (далі - «Договір») на умовах, що містяться в цій Оферті.

1.2. Товар або Послуга – об'єкт угоди сторін, який був обраний покупцем на сайті Інтернет-магазину та поміщений у кошик, або вже придбаний Покупцем у Продавця дистанційним способом.

1.3. Інтернет-магазин – сайт Продавця за адресою www.hlorka.ua створений для укладення договорів роздрібної та оптової купівлі-продажу на підставі ознайомлення Покупця із запропонованим Продавцем описом Товару за допомогою мережі Інтернет.

1.4. Покупець – дієздатна фізична особа, яка досягла 18 років, отримує інформацію від Продавця, розміщує замовлення щодо купівлі товару, що представлений на сайті Інтернет-магазину для цілей, що не пов'язані зі здійсненням підприємницької діяльності, або юридична особа чи фізична особа-підприємець.

1.5. Продавець – Фізична особа підприємець «Бондарев Богдан Володимирович» (ідентифікаційний код 3553008273), юридична особа, яка створена і діє відповідно до чинного законодавства України, місцезнаходження якої: м. Київ, вул. Героїв Оборони, буд.10А

2. Предмет Договору

2.1. Продавець зобов'язується передати у власність Покупцю Товар, а Покупець зобов'язується оплатити і прийняти Товар на умовах цього Договору.

2.2. Датою укладення Договору-оферти (акцептом оферти) та моментом повного й беззаперечного прийняттям Покупцем умов Договору вважається дата заповнення Покупцем форми замовлення, розташованої на сайті Інтернет-магазину, за умови отримання Покупцем від Продавця підтвердження замовлення в електронному вигляді. У разі необхідності, за бажанням Покупця, Договір може бути оформлений у письмовій формі.

3. Оформлення Замовлення

3.1. Покупець самостійно оформлює замовлення в Інтернет-магазину через форму «Кошика», або зробивши замовлення електронною поштою чи за номером телефону, вказаним в розділі контактів Інтернет-магазину.

3.2. Продавець має право відмовитися від передання замовлення Покупцеві у випадку, якщо відомості, вказані Покупцем під час оформлення замовлення, є неповними або викликають підозру щодо їх дійсності.

3.3. При оформленні замовлення на сайті Інтернет-магазину Покупець зобов'язується надати наступну обов'язкову інформацію, необхідну Продавцю для виконання замовлення:
• прізвище, ім'я Покупця;
• адреса, за якою слід доставити Товар (якщо доставка до адреси Покупця);
• контактний телефон;
• ідентифікаційний код для юридичної особи або фізичної-особи підприємця.

3.4. Найменування, кількість, артикул, ціна обраного Покупцем Товару вказуються в кошику Покупця на сайті Інтернет-магазину.

3.5. Якщо будь-якої із Сторін договору необхідна додаткова інформація, він має право запросити її у іншій Стороні. У разі ненадання необхідної інформації Покупцем, Продавець не несе відповідальності за надання якісної послуги Покупцю при покупці товару в інтернет-магазині.

3.6. При оформленні замовлення через оператора Продавця (п. 3.1. Цієї Оферти) Покупець зобов'язується надати інформацію, зазначену в п. 3.3 – 3.4. цієї Оферти.

3.7. Ухвалення Покупцем умов цієї Оферти здійснюється за допомогою внесення Покупцем відповідних даних в реєстраційну форму на сайті Інтернет-магазину або при оформленні Замовлення через оператора. Після оформлення Замовлення через Оператора дані про Покупця вносяться до бази даних Продавця.

3.8. Покупець несе відповідальність за достовірність наданої інформації при оформленні Замовлення.

3.9. Укладаючи Договір, тобто акцептуючи умови даної пропозиції (запропоновані умови придбання Товару), шляхом оформлення Замовлення, Покупець підтверджує наступне:
а) Покупець цілком і повністю ознайомлений, і згоден з умовами цієї пропозиції (оферти);
б) він дає дозвіл на збір, обробку та передачу персональних даних, дозвіл на обробку персональних даних діє протягом усього терміну дії Договору, а також протягом необмеженого терміну після закінчення його дії. Покупець також погоджується з тим, що Продавець має право надавати доступ та передавати його персональні дані третім особам без будь-яких додаткових повідомлень Покупця з метою виконання замовлення Покупця.

4. Ціна і Доставка Товару

4.1. Ціни на Товари та послуги визначаються Продавцем самостійно та вказані на сайті Інтернет-магазину. Всі ціни на Товари та послуги вказані на сайті у гривнях без урахування ПДВ.

4.2. Ціни на Товари та послуги можуть змінюватися Продавцем в односторонньому порядку залежно від кон'юнктури ринку. При цьому ціна окремої одиниці Товару, вартість якої оплачена Покупцем в повному обсязі, не може бути змінена Продавцем в односторонньому порядку.

4.3. Вартість Товару, яка вказана на сайті Інтернет-магазину не включає в себе вартість доставки Товару Покупцю. Вартість доставки Товару Покупець сплачує відповідно до діючих тарифів служб доставки (перевізників) безпосередньо обраній ним службі доставки (перевізнику).

4.4. Вартість Товару яка вказана на сайті Інтернет-магазину не включає в себе вартість доставки Товару на адресу Покупця.

4.5. Продавець може вказати орієнтовну вартість доставки Товару на адресу Покупця під час звернення Покупця із відповідним запитом до Продавця шляхом надіслання листа на електронну пошту або при оформленні замовлення через оператора інтернет-магазину.

4.6. Зобов'язання Покупця по оплаті Товару вважаються виконаними з моменту надходження Продавцю коштів на його рахунок.

4.7. Розрахунки між Продавцем і Покупцем за Товар здійснюються способами, зазначеними на сайті Інтернет-магазину в розділі «Оплата і Доставка».

4.8. При отриманні товару Покупець повинен у присутності представника служби доставки (перевізника) перевірити відповідність Товару якісним і кількісним характеристикам (найменування товару, кількість, комплектність, термін придатності).

4.9. Покупець або його представник під час приймання Товару підтверджує своїм підписом в товарному чеку/ або в замовленні/ або в транспортній накладній на доставку товарів, що не має претензій до кількості товару, зовнішнім виглядом і комплектності товару.

4.10. Право власності та ризик випадкової втрати або пошкодження Товару переходить до Покупця або його Представника з моменту отримання Товару Покупцем.

5. Права та обов'язки Сторін

5.1. Продавець зобов'язаний:
• передати Покупцеві товар у відповідності до умов цього Договору та замовлення Покупця;
• не розголошувати будь-яку приватну інформацію про Покупця і не надавати доступ до цієї інформації третім особам, за винятком випадків, передбачених законодавством та під час виконання Замовлення Покупця.

5.2. Продавець має право:
• змінювати умови цього Договору, а також ціни на Товари та послуги, в односторонньому порядку, розміщуючи їх на сайті Інтернет-магазину. Всі зміни набувають чинності з моменту їх публікації.

5.3. Покупець зобов'язується:
• до моменту укладення Договору ознайомитися зі змістом Договору, умовами Договору і цінами, запропонованими Продавцем на сайті Інтернет-магазину;
• повідомити всі необхідні дані, що однозначно ідентифікують його як Покупця, і достатні для доставки Покупцеві замовленого Товару.

6. Повернення Товару

6.1. Покупець має право на повернення Продавцеві непродовольчого товару належної якості, якщо товар не задовольнив його за формою, габаритами, фасоном, кольором, розміром або з інших причин не може бути ним використаний за призначенням. Покупець має право на повернення товару належної якості протягом 14 (чотирнадцяти) днів, не враховуючи дня купівлі. Повернення товару належної якості проводиться, якщо він не використовувався і якщо збережено його товарний вигляд, споживчі властивості, упаковка, пломби, ярлики, а також розрахунковий документ, виданий Покупцю за оплату Товару.

6.2. Повернення Покупцеві вартості товару належної якості здійснюється протягом 30 (тридцяти) календарних днів з моменту отримання такого Товару Продавцем за умови дотримання вимог, передбачених п. 6.1. Договору, чинним законодавством України.

6.3. Вартість товару підлягає поверненню шляхом банківського переказу на рахунок Покупця.

6.4. Повернення Товару належної якості за адресою Продавця, здійснюється за рахунок Покупця та Продавцем Покупцеві не відшкодовується.

6.5. У разі виявлення протягом встановленого гарантійного строку недоліків у Товарі, Покупець особисто, в порядку та у строки, що встановлені законодавством України, має право пред'явити Продавцеві вимоги, передбачені Законом України «Про захист прав споживачів».

6.6. Розгляд вимог, передбачених Законом України «Про захист прав споживачів», провадиться Продавцем за умови надання Покупцем документів, передбачених чинним законодавством України.

6.7. Покупець не має права відмовитися від товару належної якості, що має індивідуально-визначені властивості, якщо зазначений товар може бути використаний виключно Покупцем, який його придбав.

6.8. Повернення товару, у випадках, передбачених законом та цим Договором, здійснюється за адресою, вказаною на сайті в розділі «Контакти».

7. Відповідальність

7.1. Продавець не несе відповідальності за шкоду, заподіяну Покупцеві або третім особам внаслідок неналежного монтажу, використання, зберігання Товару придбаного у Продавця.

7.2. Продавець не несе відповідальності за неналежне, несвоєчасне виконання Замовлень і своїх зобов'язань у випадку надання Покупцем недостовірної або помилкової інформації.

7.3. Продавець і Покупець несуть відповідальність за виконання своїх зобов'язань відповідно до чинного законодавства України і положень цього Договору.

7.4. Продавець або Покупець звільняються від відповідальності за повне або часткове невиконання своїх зобов'язань, якщо невиконання є наслідком форс-мажорних обставин як: війна або військові дії, землетрус, повінь, пожежа та інші стихійні лиха, що виникли незалежно від волі Продавця і / або Покупця після укладення цього договору.

8. Конфіденційність і захист персональних даних

8.1. Надаючи свої персональні дані на сайті Інтернет-магазину при реєстрації або оформленні Замовлення, Покупець надає Продавцеві свою добровільну згоду на обробку, використання (у тому числі і передачу) своїх персональних даних, а також вчинення інших дій, передбачених Законом України «Про захист персональних даних», без обмеження терміну дії такої згоди.

8.2. Продавець зобов'язується не розголошувати отриману від Покупця інформацію. Не вважається порушенням надання Продавцем інформації контрагентам і третім особам, що діють на підставі договору з Продавцем, в тому числі і для виконання зобов'язань перед Покупцем.

8.3. Покупець несе відповідальність за підтримання своїх персональних даних в актуальному стані. Продавець не несе відповідальності за неякісне виконання або невиконання своїх зобов'язань у зв'язку з неактуальністю інформації про Покупця або невідповідністю її дійсності.

9. Інші умови

9.1. Цей договір укладено на території України і діє відповідно до чинного законодавства України.

9.2. Усі спори, що виникають між Покупцем і Продавцем, вирішуються шляхом переговорів. У випадку недосягнення врегулювання спірного питання шляхом переговорів, Покупець та/або Продавець мають право звернутися за вирішенням спору до судових органів відповідно до чинного законодавства України.

9.3. Продавець має право вносити зміни до цього Договору в односторонньому порядку, передбаченому п. 5.2.1. Договору. Крім того, зміни до Договору також можуть бути внесені за взаємною згодою Сторін в порядку, передбаченому чинним законодавством України.

АДРЕСА ТА РЕКВІЗИТИ ПРОДАВЦЯ:
ФОП «Бондарев Богдан Володимирович»
Україна, м. Київ, вул. Героїв Оборони, буд. 10А
п/р UA083052990000026002026242081 в АТ «ПРИВАТБАНК»
МФО 305299
ІПН 3553008273
Код 03127
`;

export const privacyPolicyText = `Політика конфіденційності
23.03.2023

Вступ
Ця політика захисту конфіденційності даних (надалі – Політика конфіденційності) містить інформацію про практику обробки персональних даних, наданих користувачем ФОП «Бондарев Богдан Володимирович» (надалі також – Компанія або Контролер) під час використання веб-сайту www.hlorka.ua.

Положення цієї Політики конфіденційності відповідають нормам Закону України «Про захист персональних даних» та Загального регламенту про захист даних Європейського союзу (GDPR - General Data Protection Regulation).

Під персональними даними розуміються відомості чи сукупність відомостей про користувача, який ідентифікований або може бути конкретно ідентифікований.

При здійсненні реєстрації на веб-сайті Компанії, використанні веб-сайту, оформленні замовлення, надсиланні повідомлень, відгуків тощо, Користувач надає дозвіл та однозначну згоду на обробку його персональних даних, ознайомлення та прийняття умов цієї Політики конфіденційності.

Володільцем (Контролером) даних є:
ФОП «Бондарев Богдан Володимирович»
Україна, м. Київ, вул. Героїв Оборони, буд. 10А, 03127
Веб-сайт: www.hlorka.ua
E-mail: zakaz@hlorka.in.ua

Мета обробки персональних даних
Компанія здійснює обробку персональних даних користувачів веб-сайту для:
• забезпечення зручного використання веб-сайту;
• забезпечення реалізації цивільно-правових відносин, господарських, податкових відносин;
• здійснення покладених на Компанію обов'язків у відповідності до діючого законодавства України;
• отримання платежів від користувачів;
• надсилання користувачам замовлених товарів;
• надсилання повідомлень користувачам;
• забезпечення безпеки веб-сайту та попередження шахрайства;
• маркетингових та інших цілей.

Персональні дані користувача, що можуть оброблюватися при використанні веб-сайту:
• ім'я, прізвище та по батькові;
• адреса електронної пошти;
• телефон;
• товар, що цікавить користувача;
• адреса доставки товару;
• IP адреса;
• інша інформація про комп'ютер користувача, включаючи веб-браузер, операційну систему, географічне розташування та інші дані, надані користувачем.

Форми і способи обробки персональних даних
Обробка персональних даних здійснюється відкрито і прозоро із застосуванням засобів та у спосіб, що відповідають визначеній меті такої обробки. Обробка здійснюється Компанією за допомогою автоматизованих засобів.

Права користувача

Право доступу
Відповідно до статті 15 Загального положення про захист даних (GDPR), Користувач має право запросити у Компанії підтвердження про те, чи обробляється його персональні дані. В цьому випадку Користувач має право на доступ до інформації про ці персональні дані, згаданої в статті 15 GDPR.

Право на виправлення
Відповідно до статті 16 GDPR, Користувач має право вимагати, щоб Компанія негайно виправила неточності в персональних даних Користувача. Беручи до уваги мету обробки, Користувач також має право на надання неповних персональних даних, в тому числі за допомогою надання додаткової заяви.

Право на видалення даних
Користувач має право вимагати, щоб Компанія негайно видалила персональні дані Користувача. Компанія зобов'язана негайно видалити персональні дані за умови дотримання відповідних законодавчих вимог.

Право на обмеження обробки
Відповідно до статті 18 GDPR, при певних обставинах Користувач має право вимагати, щоб Компанія обмежила обробку персональних даних Користувача.

Право на перенесення даних
Користувач має право отримувати надані ним персональні дані в структурованому, загальнодоступному і машинозчитуваному форматі, і має право на те, щоб Компанія без перешкод передала ці дані іншому обробнику за умови, що стосовно обробки даних такою особою була отримана заява про надання згоди.

Право на заперечення
Відповідно до статті 21 GDPR, Користувач має право висловити своє заперечення проти обробки його персональних даних на підставі статті 6 (1) e) або f) GDPR. Це також відноситься до складання "психологічного портрета" (з формуванням певної характеристики особистості) на підставі цих наданих даних.
Якщо Компанія обробляє персональні дані Користувача в цілях прямого маркетингу, Користувач має право в будь-який час заперечити проти обробки персональних даних з цією метою.

Право на подачу скарги в наглядовий орган
Відповідно до статті 77 GDPR, без обмеження для будь-якого адміністративного або судового засобу правового захисту, передбаченого законодавством України, Користувач має право подати скаргу в наглядовий орган держави-члена ЄС, зокрема, за зареєстрованим місцем проживання на території держави-члена ЄС, за місцем роботи або передбачуваного порушення, якщо Користувач вважає, що обробка його персональних даних порушує положення цієї Політики конфіденційності чи законодавства про захист персональних даних.

Здійснення своїх прав
Якщо Користувач бажає скористатися одним зі своїх прав, він має зв'язатися з Компанією, як із обробником даних, використовуючи вказані у цій Політиці конфіденційності контактні дані Компанії, або скористатися будь-якою іншою формою, яку Компанія пропонує для зв'язку.

Протоколювання на веб-серверах
Коли Користувач відвідує веб-сайт Компанії, особа, яка на замовлення Компанії (надалі - постачальник послуг) здійснює управління веб-сайтом, обробляє і зберігає технічні дані про пристрій, який Користувач використовує (операційна система, дозвіл екрана і інші неособисті функції), і про браузер (версія, мовні налаштування), зокрема загальнодоступну IP-адресу комп'ютера, або будь-якого пристрою який використовує Користувач для відвідування веб-сайту Компанії, включаючи дату і час доступу.

Постачальник послуг Компанії використовує дані, що підлягають обробці, для статистичних цілей способом, що не ідентифікує особистість Користувача. Ці статистичні дані не містять ніяких персональних даних. Правовою основою для складання статистики є стаття 6 (1) f) GDPR.

Крім того, IP-адреса використовується для того, щоб Користувач мав технічну можливість отримати доступ до веб-сайту Компанії і використовував його, а також для виявлення і запобігання хакерським атакам. Правовою основою для обробки таких даних є стаття 6 (1) f) GDPR.

Збережені IP-дані видаляються (за допомогою анонімізації), як тільки вони більше не потрібні для виявлення або захисту від атаки.

Файли Cookies
Компанія використовує файли cookies і аналогічні технології (локальне сховище) для забезпечення технічної функціональності веб-сайту, аналізу, як користувачі використовують веб-сайт, і збереження налаштувань користувачів в своєму браузері.

Cookie – це невеликий текстовий файл, який браузер, що використовує Користувач, зберігає на комп'ютері Користувача при переході на веб-сайт Компанії. Файли cookies зберігаються протягом різних періодів часу. Користувач може в будь-який час налаштувати список cookies, які буде приймати його браузер.

Компанія використовує cookies для наступних цілей:
• технічно необхідні файли cookies, що призначені для використання функцій веб-сайту (наприклад, для ідентифікації користувача);
• функціональні cookies, які використовуються для технічного виконання певних функцій, які хоче використати Користувач;
• аналітичні cookies, які призначені для аналізу поведінки Користувача;
• сторонні cookies, які зберігаються третіми особами, чиї функції інтегруються на веб-сайті Компанії.

Більшість браузерів дозволяють налаштовувати, які файли cookies слід зберігати, і дозволяють видаляти (певні) файли cookies. Якщо Користувач обмежує зберігання файлів cookies, то використовувати всі функції веб-сайту Компанії буде неможливо.

Форма зворотного зв'язку
Якщо Користувач відправляє Компанії повідомлення за допомогою запропонованих форм зворотного зв'язку, для обробки запиту Компанія буде використовувати дані, які повідомлені Користувачем. Дані будуть видалені після задоволення запиту Користувача.

Розкриття даних третім особам
Компанія не розголошує передані Користувачем персональні дані третім особам (особливо, не в маркетингових цілях).

Однак для функціональної роботи веб-сайту Компанії або для надання товарів/послуг Компанія співпрацює з постачальниками послуг. Персональні дані Користувача можуть бути повідомлені таким постачальникам послуг. В даному випадку Компанія вживає всіх заходів, необхідних відповідно до законодавства про захист даних, для безпечної обробки даних.

Обробка даних за межами ЄС
Ми обробляємо персональні дані Користувача в Україні, ЄС. Однак деякі постачальники послуг, чиї плагіни і інструменти використовує Компанія, можуть обробляти дані за межами України. Компанія бере зобов'язання щодо забезпечення належного рівня захисту даних.

Google Analytics
В рамках угоди про обробку даних використовуємо сервіс, що надається компанією Google LLC, Amphitheatre Parkway, Mountain View, CA 94043, USA. Google Analytics використовується таким чином, що IP-адреса Користувача використовується тільки в анонімній формі.

Google AdSense
Веб-сайт Компанії використовує Google AdSense, сервіс для інтеграції рекламних оголошень Google Inc. Google AdSense використовує файли «cookies», щоб допомогти веб-сайту проаналізувати те, як користувачі використовують сайт.

Google Adwords / Відстеження конверсій
Веб-сайт Компанії використовує Google AdWords — рекламну онлайн-програму компанії Google Inc. В рамках Google AdWords використовується відстеження конверсій. Файли cookies видаляються через 30 днів і не призначені для ідентифікації користувачів.

Google Remarketing / Double Click
Веб-сайт Компанії використовує функції ремаркетингу Google Analytics в поєднанні з функціями суміжного використання декількох пристроїв в Google AdWords і Google DoubleClick.
Додаткову інформацію та правила захисту даних можна знайти в політиці конфіденційності Google за адресою: https://www.google.com/policies/technologies/ads/.

Оновлення політики конфіденційності
Компанія завжди підтримує цю Політику конфіденційності в актуальному стані, тому залишає за собою право час від часу змінювати її та оновлювати практику обробки використання персональних даних Користувача. Поточна версія Політики конфіденційності завжди доступна на веб-сайті.

Якщо Користувач має будь-які питання щодо цієї Політики конфіденційності, він може зв'язатись з Компанією, використовуючи: email: zakaz@hlorka.in.ua
`;
